package org.taba.notification.model.constants;

import lombok.AllArgsConstructor;
import lombok.Getter;

public class NotificationConstants {

    public enum NotificationType {
        EMAIL,
        SMS
    }

    public enum NotificationDestinationGroup {
        COMPLAINING,
        COMPLAINANT,
        REPRESENTATIVE
    }

    @Getter
    @AllArgsConstructor
    public enum NotificationMessages {

        _01("خواهان گرامی : آقای/خانم %s دادخواست شما با موفقیت در سامانه جامع روابط کار ثبت شد. شما می توانید از طریق همین سامانه از وضعیت دادخواست خود مطلع شوید. کلاسه پرونده: %s "),//
        _02("انصراف از دادخواست شما با موفقیت ثبت شد. کلاسه پرونده: %s "),//
        _03("کاربر گرامی: نماینده شما از رسیدگی به امور دادخواست شما انصراف داده است. لطفا جهت انتخاب نماینده جدید و یا ثبت دادخواست خود به کارتابل خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),//
        _04("کاربر گرامی :دادخواست شما نیاز به اصلاح دارد.شما ظرف مدت 48 ساعت فرصت دارید با مراجعه به کارتابل خود در سامانه جامع روابط کار، نسبت به رفع نقص و ارسال مجدد دادخواست اقدام نمایید.در غیر اینصورت دادخواست شما ابطال می گردد. کلاسه پرونده: %s "),
        _05("برای شما تعیین وقت شده است. شما می توانید با مراجعه  به کارتابل خود در سامانه جامع روابط کار از وقت جلسه رسيدگي خود مطلع گردید. کلاسه پرونده: %s "),
        _06("شما ظرف مدت 10 روز فرصت دارید با مراجعه به کارتابل خود در سامانه جامع روابط کار، نسبت به رفع نقص و ارسال مجدد دادخواست اقدام نمایید، در غیر اینصورت دادخواست شما ابطال می گردد. کلاسه پرونده: %s "),
        _07("شما می توانید با مراجعه  به کارتابل خود در سامانه جامع روابط کار از وقت جلسه رسيدگي خود مطلع گردید. کلاسه پرونده: %s "),//مشابه 5
        _08("کاربر گرامی دادخواست شما به دلیل عدم اصلاح در ظرف مدت مقرر ابطال گردید.در صورت تمايل مي توانيد نسبت به ثبت دادخواست جدید اقدام نمائید. کلاسه پرونده: %s "),
        _09("کاربر گرامی: آقای/خانم: %s را به عنوان نماینده جهت پیگیری دادخواست خود انتخاب نموده اید. پیگیری روند رسیدگی به دادخواست شما از طریق ایشان قابل انجام است. کلاسه پرونده: %s "),//
        _10("کاربر گرامی شما به عنوان نماینده آقای/خانم: %s انتخاب شده اید. جهت ثبت و یا پیگیری دادخواست ایشان به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),//
        _11("کاربر گرامی: شما آقای/خانم %s را از نمایندگی خود عزل نموده اید. کلاسه پرونده: %s "),//
        _12("کاربر گرامی  نمایندگی شما توسط آقای/خانم %s لغو شد. کلاسه پرونده: %s "),//
        _13("کاربر گرامی:دادخواستی علیه شما مطرح شده است. برای اطلاع از مفاد آن و زمان و مکان حضور در جلسه رسیدگی به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),//
        _14("کاربر گرامی:رای برای شما صادر شده است.برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "),
        _15("کاربر گرامی مدرک/سند/لایحه جدیدی به پرونده الکترونیکی افزوده شده است.برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "),
        _16("کاربر گرامی: وقت جلسه رسیدگی شما تجدید شده است.برای اطلاع از زمان و مکان حضور در جلسه رسیدگی به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),
        _17("کاربر گرامی:دادنامه شما صادر شده است.برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "),//مشابه 28
        _18("کاربر گرامی:نماینده شما از رسیدگی به امور دادخواست شما انصراف داده است لطفا جهت انتخاب نماینده جدید و یا ثبت دادخواست خود به کارتابل خود در سامانه جامع ورابط کار مراجعه نمایید. کلاسه پرونده: %s "),//مشابه 3
        _19("کاربر گرامی :دادخواست تجدید نظرخواهی شما با موفقیت در سامانه جامع روابط کار ثبت شد. شما می توانید با مراجعه  به کارتابل خود در سامانه جامع روابط کار از وضعیت دادخواست خود مطلع شوید. کلاسه پرونده: %s "),
        _20("کاربرگرامی: نسبت به دادنامه صادره دادخواست تجدید نظر خواهی ثبت شده است. برای اطلاع از وضعیت به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),
        _21("کاربرگرامی:دادخواست تجدید نظر شما تاييد و تاریخ و زمان رسیدگی تعیین شد. شما می توانید با مراجعه به کارتابل خود در سامانه جامع روابط کار از وقت جلسه رسيدگي خود مطلع گردید. کلاسه پرونده: %s "),
        _22("کاربر گرامی : آقا/ خانم %s شما را به عنوان نماینده جهت پیگیری دادخواست تجدید نظرخواهی خود انتخاب نموده اید.  پیگیری روند رسیدگی به دادخواست شما از طریق ایشان قابل انجام است. کلاسه پرونده: %s "),
        _23("کاربر گرامی:شما به عنوان نماینده آقا / خانم %s انتخاب شده اید. جهت ثبت و یا پیگیری دادخواست تجدید نظرخواهی ایشان به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),//
        _24("کاربر گرامی: شما آقا / خانم %s شما را از نمایندگی خود عزل نموده اید. کلاسه پرونده: %s "),//مشابه 11 است.
        _25("کاربر گرامی: نمایندگی شما توسط آقا / خانم %s لغو شد. کلاسه پرونده: %s "),//مشابه 12 است.
        _26("کاربرگرامی:دادخواست تجدیدنظرخواهی علیه شما مطرح شده است. برای اطلاع از مفاد آن و زمان و مکان حضور در جلسه رسیدگی، به حساب کاربری خود در سامانه جامع روابط کار مراجعه نمایید. کلاسه پرونده: %s "),//
        _27("کاربرگرامی: نتیجه جلسه  برای شما اعلام شده است. برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "),
        _28("کاربرگرامی:دادنامه شما صادر شده است. برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "), //
        _29("کاربرگرامی:مدرک/سند/لایحه جدیدی به پرونده الکترونیکی افزوده شده است. برای اطلاع از مفاد آن به حساب کاربری خود در سامانه جامع روابط کار مراجعه فرمایید. کلاسه پرونده: %s "),//مشابه 15
        _30("درخواست اجرای احکام دادگستری برای کلاسه پرونده ذیل ثبت گردید. کلاسه پرونده: %s "),
        _31("کاربر گرامی با توجه به اینکه رسیدگی در مراجع حل اختلاف با ارایه مدارک و مستندات لازم صورت میگیرد، ضروری است ضمن به همراه داشتن اصل مدارک در روز جلسه ،الزاما تمامی مدارک در سیستم بارگذاری شود. کلاسه پرونده: %s "),
        _32("کاربر گرامی جهت دریافت فرم های  اجراییه به اداره کار مراجعه نمایید. کلاسه پرونده: %s ");

        private String text;

    }

}
